{
    "@context": "http://lynx-project.eu/doc/jsonld/skosterm.json",
    "@id": "LT5823376",
    "@type": "skos:Concept",
    "inScheme": "labourlaw",
    "source": "https://iate.europa.eu/entry/result/929865",
    "prefLabel": [
        {
            "@language": "es",
            "@value": "autoridad laboral"
        },
        {
            "@language": "en",
            "@value": "Swedish Work Environment Authority"
        },
        {
            "@language": "de",
            "@value": "Zentralamt für Arbeitsumwelt"
        },
        {
            "@language": "nl",
            "@value": "Arbeidsmilieuautoriteit"
        }
    ],
    "altLabel": [
        {
            "@language": "nl",
            "@value": "Arbeidsmilieu-inspectie Arbeidsmilieu-autoriteit"
        },
        {
            "@language": "es",
            "@value": ""
        }
    ],
    "definition": [
        {
            "@language": "es",
            "@value": "Creada en 2001 mediante la fusión de 10 distritos de la Inspección del Trabajo IATE:905412 y la Dirección Nacional de Seguridad y Sanidad Laboral IATE:905378 . Su objetivo consiste en reducir los riesgos de enfermedad o accidente en el lugar de trabajo y mejorar el entorno laboral con una perspectiva holística (desde los puntos de vista físico mental social y organizativo).Vela por el cumplimiento de la legislación relativa al entorno laboral al horario de trabajo al tabaquismo y cuestiones relacionadas con la ingeniería genética y los plaguicidas."
        },
        {
            "@language": "en",
            "@value": "The Swedish Work Environment Authority is the administrative authority for questions relating to the working environment.It was formed in 2001 through the amalgamation of the ten districts of the Labour Inspectorate and the National Board of Occupational Safety and Health.The Authority’s paramount objective is to reduce the risks of ill-health and accidents in the workplace and to improve the work environment in a holistic perspective i.e. from the physical mental social and organisational viewpoints."
        },
        {
            "@language": "de",
            "@value": "nationale Behörde für die Arbeitsaufsicht in Schweden führt Kontrollen an Arbeitsstätten und andere Aufsichtsmaßnahmen durch und kann rechtsverbindliche Bestimmungen erlassen."
        }
    ]
}