{
    "@context": {
        "@base": "http://lynx-project.eu/kos/",
        "dcterms": "http://purl.org/dc/terms/",
        "rdfs": "http://www.w3.org/2000/01/rdf-schema#",
        "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#",
        "dc": "http://purl.org/dc/elements/1.1/",
        "skos": "http://www.w3.org/2004/02/skos/core#",
        "owl": "http://www.w3.org/2002/07/owl#",
        "skos:broader": {
            "@type": "@id"
        },
        "skos:inScheme": {
            "@type": "@id"
        },
        "skos:related": {
            "@type": "@id"
        },
        "skos:narrower": {
            "@type": "@id"
        },
        "skos:hasTopConcept": {
            "@type": "@id"
        },
        "skos:topConceptOf": {
            "@type": "@id"
        }
    },
    "@id": "LT5568558",
    "@type": "skos:Concept",
    "skos:inScheme": "-rechenschaftspflicht",
    "owl:sameAs": "https://iate.europa.eu/entry/result/899397",
    "skos:topConceptOf": "LT5568558",
    "skos:prefLabel": [
        {
            "@language": "es",
            "@value": "responsabilidad"
        },
        {
            "@language": "en",
            "@value": "accountability"
        },
        {
            "@language": "de",
            "@value": "-rechenschaftspflicht"
        },
        {
            "@language": "nl",
            "@value": "verantwoordingsplicht"
        },
        {
            "@language": "es",
            "@value": "rendición de cuentas"
        },
        {
            "@language": "en",
            "@value": "accountability"
        },
        {
            "@language": "de",
            "@value": "-rechenschaftspflicht"
        },
        {
            "@language": "nl",
            "@value": "verantwoordingsplicht"
        },
        {
            "@language": "es",
            "@value": "obligación de rendir cuentas"
        },
        {
            "@language": "en",
            "@value": "accountability"
        },
        {
            "@language": "de",
            "@value": "-rechenschaftspflicht"
        },
        {
            "@language": "nl",
            "@value": "verantwoordingsplicht"
        },
        {
            "@language": "es",
            "@value": "obligación de rendir cuentas"
        },
        {
            "@language": "en",
            "@value": "accountability"
        },
        {
            "@language": "de",
            "@value": "-rechenschaftspflicht"
        },
        {
            "@language": "nl",
            "@value": "verantwoordingsplicht"
        },
        {
            "@language": "es",
            "@value": "responsabilidad vertical"
        },
        {
            "@language": "en",
            "@value": "vertical accountability"
        },
        {
            "@language": "de",
            "@value": "-rechenschaftspflicht"
        }
    ],
    "skos:altLabel": [
        {
            "@language": "es",
            "@value": "obligación de rendir cuentas"
        },
        {
            "@language": "es",
            "@value": "rendición de cuentas"
        },
        {
            "@language": "de",
            "@value": "vertikale Accountability"
        },
        {
            "@language": "de",
            "@value": ""
        }
    ],
    "skos:definition": [
        {
            "@language": "es",
            "@value": "Obligación (legal o moral) de aceptar las consecuencias de una acción propia o ajena."
        },
        {
            "@language": "en",
            "@value": "obligation of an individual or organisation to account for its activities accept responsibility for them and to disclose the results in a transparent manner"
        },
        {
            "@language": "de",
            "@value": "i.w.S.: Pflicht (bspw. politischer oder wirtschaftlicher Entscheidungsträger) Verantwortung für die eigenen Entscheidungen und Handlungen zu übernehmen und diese zu rechtfertigen;i.e.S.: Pflicht über Einnahmen und Ausgaben Bericht zu erstatten"
        },
        {
            "@language": "en",
            "@value": "principle intended to ensure that controllers are more generally in control and in the position to ensure and demonstrate compliance with data protection principles in practice"
        },
        {
            "@language": "es",
            "@value": "Es el deber que tienen las personas o las entidades a las que se han confiado recursos públicos (incluidas empresas y corporaciones públicas) de asumir responsabilidades de orden fiscal gerencial y programático que se les han conferido y de informar a quienes se las han asignado."
        },
        {
            "@language": "en",
            "@value": "The obligations of persons or entities including public enterprises and corporations entrusted with public resources to be answerable for the fiscal managerial and programme responsibilities that have been conferred on them and to report to those that have conferred these responsibilities on them."
        },
        {
            "@language": "de",
            "@value": "Verpflichtung natürlicher und juristischer Personen einschließlich öffentlicher Unternehmen und Körperschaften denen öffentliche Mittel anvertraut wurden Rechenschaft über Mittelverwendung Managementtätigkeit und Programmverwaltung abzulegen und den Stellen von denen sie mit diesen Aufgaben betraut wurden Bericht zu erstatten."
        },
        {
            "@language": "nl",
            "@value": "De verplichtingen van personen of entiteiten waaronder overheidsbedrijven en openbare lichamen waaraan openbare middelen zijn toevertrouwd tot het afleggen van verantwoording inzake de hun toegekende verantwoordelijkheden op fiscaal bestuurlijk en programmeringsgebied en tot verslaglegging aan degenen die hun deze verantwoordelijkheden hebben toevertrouwd."
        },
        {
            "@language": "es",
            "@value": "obligación impuesta a la persona o entidad auditada de demostrar que ha administrado o fiscalizado los fondos que se le han confiado conforme a las normas que se pusieron a su disposición"
        },
        {
            "@language": "en",
            "@value": "duty imposed on an audited person or entity to show that he/it has administered or controlled the funds entrusted to him/it in accordance with the terms on which the funds were provided"
        },
        {
            "@language": "de",
            "@value": "einer Person oder geprüften Stelle auferlegte Pflicht nachzuweisen daß sie die ihr anvertrauten Mittel gemäß den Bedingungen unter denen die Mittel ihr zur Verfügung gestellt wurden verwaltet oder kontrolliert hat"
        },
        {
            "@language": "nl",
            "@value": "aan een gecontroleerde opgelegde verplichting om aan te tonen dat hij de hem toevertrouwde middelen overeenkomstig de voorwaarden waaronder deze middelen hem zijn toegekend heeft beheerd of gecontroleerd"
        },
        {
            "@language": "es",
            "@value": "La responsabilidad vertical se refiere a los mecanismos utilizados por los ciudadanos y los agentes que no pertenecen al Estado tales como la sociedad civil las ONG y los medios de comunicación para que el Gobierno rinda cuentas."
        },
        {
            "@language": "en",
            "@value": "mechanisms used by citizens and non-state actors such as civil society nongovernmental organizations and the media to hold government to account"
        },
        {
            "@language": "de",
            "@value": "politisch partizipative Dimension also die Kontrolle der Herrschaftsgewalt durch Gesellschaft und Bürger"
        }
    ]
}