{
    "@context": {
        "@base": "http://lynx-project.eu/kos/",
        "dcterms": "http://purl.org/dc/terms/",
        "rdfs": "http://www.w3.org/2000/01/rdf-schema#",
        "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#",
        "dc": "http://purl.org/dc/elements/1.1/",
        "skos": "http://www.w3.org/2004/02/skos/core#",
        "owl": "http://www.w3.org/2002/07/owl#",
        "skos:broader": {
            "@type": "@id"
        },
        "skos:inScheme": {
            "@type": "@id"
        },
        "skos:related": {
            "@type": "@id"
        },
        "skos:narrower": {
            "@type": "@id"
        },
        "skos:hasTopConcept": {
            "@type": "@id"
        },
        "skos:topConceptOf": {
            "@type": "@id"
        }
    },
    "@id": "LT4678893",
    "@type": "skos:Concept",
    "skos:inScheme": "-verlorene",
    "owl:sameAs": "https://iate.europa.eu/entry/result/1607317",
    "skos:topConceptOf": "LT4678893",
    "skos:prefLabel": [
        {
            "@language": "es",
            "@value": "tiempo perdido"
        },
        {
            "@language": "en",
            "@value": "lost time"
        },
        {
            "@language": "de",
            "@value": "-verlorene"
        },
        {
            "@language": "nl",
            "@value": "verloren tijd"
        },
        {
            "@language": "es",
            "@value": "costes irrecuperables"
        },
        {
            "@language": "en",
            "@value": "sunk costs"
        },
        {
            "@language": "de",
            "@value": "-verlorene"
        },
        {
            "@language": "nl",
            "@value": "verzonken kosten"
        },
        {
            "@language": "es",
            "@value": "costes irrecuperables"
        },
        {
            "@language": "en",
            "@value": "sunk costs"
        },
        {
            "@language": "de",
            "@value": "-verlorene"
        },
        {
            "@language": "nl",
            "@value": "verzonken kosten"
        },
        {
            "@language": "en",
            "@value": "looseness factor"
        },
        {
            "@language": "de",
            "@value": "-verlorene"
        },
        {
            "@language": "nl",
            "@value": "verliesfactor"
        },
        {
            "@language": "en",
            "@value": "provisional marks"
        },
        {
            "@language": "de",
            "@value": "-verlorene"
        },
        {
            "@language": "nl",
            "@value": "verloren punten"
        }
    ],
    "skos:altLabel": [
        {
            "@language": "de",
            "@value": "versunkene Kosten"
        },
        {
            "@language": "nl",
            "@value": "sunk costs"
        },
        {
            "@language": "nl",
            "@value": "verloren breedte"
        },
        {
            "@language": "de",
            "@value": ""
        }
    ],
    "skos:definition": [
        {
            "@language": "es",
            "@value": "\"Los costes irrecuperables son (à) costes fijos ya incurridos y que no pueden recuperarse. Surgen porque algunas actividades requieren activos especializados que no pueden destinarse fácilmente a otros usos. Los mercados de segunda mano de tales activos son por tanto limitados. Pueden citarse como ejemplos de costes irrecuperables las inversiones en equipos con los que sólo se puede producir un producto determinado el desarrollo de productos para clientes específicos los gastos de publicidad y los gastos de I+D.\""
        },
        {
            "@language": "de",
            "@value": "Kosten bei Durchführung e. (Investitions)Entscheidung die auch bei deren Rückgängigmachungnicht wieder eingeholt werden können; z.B. verursacht d. Bau e. Kernkraftwerks hohe verlorene Kosten da die Anlage bei e. Rückzug aus der Kernenergie nicht alternativ genutzt werden kann"
        },
        {
            "@language": "nl",
            "@value": "De relatief hoge kosten die zijn gemaakt voor reclame het opbouwen van de goodwill de ontwikkeling van speciale productiemiddelen research enz. welke bij eventuele sluiting van de onderneming aanzienlijk minder opbrengen dan hun boekwaarde of de in de loop der jaren daarin geïnvesteerde kosten. Zij vormen aldus dikwijls niet alleen een drempel voor het verlaten van de bedrijfstak maar eveneens een barrière voor eventuele toetreders (door deze drempels zijn zij ongunstig in het licht van de zogenaamde marktfluïditeit."
        },
        {
            "@language": "es",
            "@value": "Costes fijos ya incurridos y que no pueden recuperarse."
        },
        {
            "@language": "en",
            "@value": "fixed costs that have already been incurred and cannot be recovered"
        },
        {
            "@language": "de",
            "@value": "Fixkosten die bereits angefallen sind und nicht wieder eingebracht werden können"
        },
        {
            "@language": "nl",
            "@value": "Verzonken kosten zijn vaste kosten die reeds zijn gemaakt en niet kunnen worden teruggevorderd. Dergelijke kosten ontstaan omdat voor sommige activiteiten gespecialiseerde activa nodig zijn die niet gemakkelijk voor andere toepassingen kunnen worden aangewend. De tweedehandsmarkten voor deze activa zijn dus beperkt. Voorbeelden van verzonken kosten zijn investeringen in uitrusting waarmee slechts één specifiek product kan worden vervaardigd de ontwikkeling van producten voor specifieke klanten reclame- en O&amp;O-uitgaven."
        },
        {
            "@language": "en",
            "@value": "when the ratio of width of waterway actually provided to that theoretically required is more than unitythe ratio is called the \" looseness factor\""
        },
        {
            "@language": "de",
            "@value": "wenn das Breitenverhaeltnis der tatsaechlich vorgesehenen Wasserstrasse zu der theoretisch moeglichen groesser als \"1\" ist dann wird das Verhaeltnis als Verlorene Breite (Verlustfaktor) bezeichnet"
        }
    ]
}