{
    "@context": {
        "dcterms": "http://purl.org/dc/terms/",
        "rdfs": "http://www.w3.org/2000/01/rdf-schema#",
        "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#",
        "dc": "http://purl.org/dc/elements/1.1/",
        "skos": "http://www.w3.org/2004/02/skos/core#",
        "owl": "http://www.w3.org/2002/07/owl#",
        "skos:broader": {
            "@type": "@id"
        },
        "skos:inScheme": {
            "@type": "@id"
        },
        "skos:related": {
            "@type": "@id"
        },
        "skos:narrower": {
            "@type": "@id"
        },
        "skos:hasTopConcept": {
            "@type": "@id"
        },
        "skos:topConceptOf": {
            "@type": "@id"
        }
    },
    "@id": "LT3941911",
    "@type": "skos:Concept",
    "skos:inScheme": "annuität",
    "owl:sameAs": "https://iate.europa.eu/entry/result/160725",
    "skos:topConceptOf": "LT3941911",
    "skos:prefLabel": [
        {
            "@language": "es",
            "@value": "anualidad"
        },
        {
            "@language": "en",
            "@value": "annuity"
        },
        {
            "@language": "de",
            "@value": "annuität"
        },
        {
            "@language": "nl",
            "@value": "lijfrenteverzekering"
        },
        {
            "@language": "en",
            "@value": "annual repayment"
        },
        {
            "@language": "de",
            "@value": "annuität"
        },
        {
            "@language": "nl",
            "@value": "annuiteit"
        },
        {
            "@language": "es",
            "@value": "porcentaje anual constante"
        },
        {
            "@language": "en",
            "@value": "constant annual percent"
        },
        {
            "@language": "de",
            "@value": "annuität"
        },
        {
            "@language": "nl",
            "@value": "vaste rentevoet"
        },
        {
            "@language": "es",
            "@value": "anualidad garantizada"
        },
        {
            "@language": "en",
            "@value": "guaranteed annuity"
        },
        {
            "@language": "de",
            "@value": "annuität"
        },
        {
            "@language": "nl",
            "@value": "gewaarborgde annuïteit"
        },
        {
            "@language": "es",
            "@value": "amortización en anualidades constantes"
        },
        {
            "@language": "en",
            "@value": "redemption in constant annuities"
        },
        {
            "@language": "de",
            "@value": "annuität"
        },
        {
            "@language": "nl",
            "@value": "aflossing in vaste annuïteiten"
        }
    ],
    "skos:altLabel": [
        {
            "@language": "es",
            "@value": " seguro de renta"
        },
        {
            "@language": "nl",
            "@value": " lijfrente"
        },
        {
            "@language": "nl",
            "@value": " lijfrentecontract"
        },
        {
            "@language": "en",
            "@value": " annuity"
        },
        {
            "@language": "de",
            "@value": " Jahrestilgungssatz"
        },
        {
            "@language": "de",
            "@value": ""
        }
    ],
    "skos:definition": [
        {
            "@language": "es",
            "@value": "un contrato financiero ofrecido por ejemplo por una empresa de seguros devida que garantiza el pago fijo o variable de una renta (mensual trimestral semestral o anual) durante la vida de una persona (vitalicista) o durante un período de tiempo determinado. Se diferencia del contrato de seguro de vida que proporciona unos ingresos al beneficiario tras el fallecimiento de la persona asegurada. La anualidad puede adquirirse a plazos o pagando una cantidad única a tanto alzado. Las prestaciones pueden comenzar de inmediato o en un momento prefijado o a una edad determinada. La anualidad constituye una manera de garantizar unos ingresos regulares en la jubilación a personas que han ahorrado en un plan deaportación definida."
        },
        {
            "@language": "en",
            "@value": "financial contract sold by a life insurance company for example that guarantees a fixed or variable payment of income benefit (monthly quarterly half-yearly or yearly) for the life of a person(s) (the annuitant) or for a specified period of time"
        },
        {
            "@language": "de",
            "@value": "Finanzprodukt das z. B. von einem Lebensversicherungsunternehmen verkauft wird das die fixe oder variable Zahlung einer Einkommensleistung (monatlich vierteljährlich halbjährlich oder jährlich) für die Lebensdauer einer Person (Pensions- bzw. Rentenempfänger/in) oder für einen festgelegten Zeitraum garantiert."
        },
        {
            "@language": "nl",
            "@value": "financieel contract verkocht door bijvoorbeeld een levensverzekeringsmaatschappij dat een vast of variabel inkomen (per maand kwartaal half jaar of jaar) garandeert gedurende het leven van een persoon (de lijfrentetrekker) of gedurende een bepaalde periode"
        },
        {
            "@language": "en",
            "@value": "an annual instalment normally equal paid towards the extinction of a debt including the capital and interest portions; an annual payment comprising both repayment of principal and servicing of interest; any of several parts into which a debt or other sum payable is divided for payment at successive times"
        },
        {
            "@language": "de",
            "@value": "gleichbleibende Jahresrate die Tilgung und Zinsen auf eine Kapitalschuld umfaßt ;die regelmaessige Jahreszahlung bei der Tilgung einer Kapitalschuld Umfasst Zinsquote und Tilgungsquote"
        },
        {
            "@language": "nl",
            "@value": "vast bedrag per jaar aan rente en aflossing op de hoofdsom van een schuld; gelijke jaarlijkse aflossingssom van een schuld bestaande uit een groter wordend deel kapitaal en een kleiner wordend deel interest; vaste jaarlijkse som voor aflossing van een schuld"
        },
        {
            "@language": "en",
            "@value": "the percentage required to pay the principal and interest to amortize the loan"
        },
        {
            "@language": "en",
            "@value": "a life insurance policy of any kind which has a condition that it shall be paid for at least a determined number of years whatever may happen"
        },
        {
            "@language": "en",
            "@value": "for redemption purposesthe division of issue into tranches with various maturity dates scheduled at regular intervals until the entire issue is retired"
        }
    ]
}