{
    "@context": {
        "@base": "http://lynx-project.eu/kos/",
        "dcterms": "http://purl.org/dc/terms/",
        "rdfs": "http://www.w3.org/2000/01/rdf-schema#",
        "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#",
        "dc": "http://purl.org/dc/elements/1.1/",
        "skos": "http://www.w3.org/2004/02/skos/core#",
        "owl": "http://www.w3.org/2002/07/owl#",
        "skos:broader": {
            "@type": "@id"
        },
        "skos:inScheme": {
            "@type": "@id"
        },
        "skos:related": {
            "@type": "@id"
        },
        "skos:narrower": {
            "@type": "@id"
        },
        "skos:hasTopConcept": {
            "@type": "@id"
        },
        "skos:topConceptOf": {
            "@type": "@id"
        }
    },
    "@id": "LT6122334",
    "@type": "skos:Concept",
    "skos:inScheme": "sklaverei",
    "owl:sameAs": "https://iate.europa.eu/entry/result/153187",
    "skos:topConceptOf": "LT6122334",
    "skos:prefLabel": [
        {
            "@language": "es",
            "@value": "esclavitud"
        },
        {
            "@language": "en",
            "@value": "slavery"
        },
        {
            "@language": "de",
            "@value": "sklaverei"
        },
        {
            "@language": "nl",
            "@value": "slavernij"
        },
        {
            "@language": "es",
            "@value": "esclavitud contemporánea"
        },
        {
            "@language": "en",
            "@value": "modern slavery"
        },
        {
            "@language": "de",
            "@value": "sklaverei"
        },
        {
            "@language": "nl",
            "@value": "moderne slavernij"
        },
        {
            "@language": "es",
            "@value": "esclavitud sexual"
        },
        {
            "@language": "en",
            "@value": "sexual slavery"
        },
        {
            "@language": "de",
            "@value": "sklaverei"
        },
        {
            "@language": "nl",
            "@value": "seksuele slavernij"
        },
        {
            "@language": "es",
            "@value": "esclavitud doméstica"
        },
        {
            "@language": "en",
            "@value": "domestic slavery"
        },
        {
            "@language": "de",
            "@value": "sklaverei"
        },
        {
            "@language": "nl",
            "@value": "huisslavernij"
        },
        {
            "@language": "es",
            "@value": "relator especial sobre las formas contemporáneas de la esclavitud, incluidas sus causas y consecuencias"
        },
        {
            "@language": "en",
            "@value": "Special Rapporteur on contemporary forms of slavery, including its causes and its consequences"
        },
        {
            "@language": "de",
            "@value": "sklaverei"
        },
        {
            "@language": "nl",
            "@value": "speciale rapporteur voor hedendaagse vormen van slavernij, met inbegrip van de oorzaken en gevolgen daarvan"
        }
    ],
    "skos:altLabel": [
        {
            "@language": "es",
            "@value": "esclavitud moderna"
        },
        {
            "@language": "es",
            "@value": "forma contemporánea de esclavitud"
        },
        {
            "@language": "en",
            "@value": "contemporary slavery"
        },
        {
            "@language": "es",
            "@value": "esclavitud moderna"
        },
        {
            "@language": "de",
            "@value": "Sklaverei im Haushalt"
        },
        {
            "@language": "es",
            "@value": "relator especial sobre las formas contemporáneas de la esclavitud"
        },
        {
            "@language": "en",
            "@value": "UN Special Rapporteur on Contemporary forms of slavery"
        },
        {
            "@language": "en",
            "@value": "SR on contemporary forms of slavery, including its causes and its consequences"
        },
        {
            "@language": "en",
            "@value": "United Nations Special Rapporteur on Contemporary forms of slavery"
        },
        {
            "@language": "en",
            "@value": "Special Rapporteur on contemporary forms of slavery"
        },
        {
            "@language": "en",
            "@value": "SR on contemporary forms of slavery"
        },
        {
            "@language": "en",
            "@value": "United Nations Special Rapporteur on contemporary forms of slavery"
        },
        {
            "@language": "en",
            "@value": "UN Special Rapporteur on contemporary forms of slavery"
        },
        {
            "@language": "en",
            "@value": "Special Rapporteur on Slavery"
        },
        {
            "@language": "en",
            "@value": "United Nations Special Rapporteur on Slavery"
        },
        {
            "@language": "en",
            "@value": "UN Special Rapporteur on Slavery"
        },
        {
            "@language": "en",
            "@value": "SR on Slavery"
        },
        {
            "@language": "de",
            "@value": "Sonderberichterstatter über moderne Formen der Sklaverei"
        },
        {
            "@language": "de",
            "@value": "Sonderberichterstatter für Sklaverei"
        },
        {
            "@language": "nl",
            "@value": "speciale rapporteur voor hedendaagse vormen van slavernij"
        },
        {
            "@language": "nl",
            "@value": "speciale rapporteur voor slavernij"
        },
        {
            "@language": "de",
            "@value": ""
        }
    ],
    "skos:definition": [
        {
            "@language": "es",
            "@value": "La esclavitud es el estado o condición de un individuo sobre el cual se ejercitan los atributos del derecho de propiedad o algunos de ellos. La trata de esclavos comprende todo acto de captura adquisición o cesión de un individuo para venderle o cambiarle; todo acto de cesión por venta o cambio de un esclavo adquirido para venderle o cambiarle y en general todo acto de comercio o de transporte de esclavos."
        },
        {
            "@language": "en",
            "@value": "Slavery is the status or condition of a person over whom any or all of the powers attaching to the right of ownership are exercised. The slave trade includes all acts involved in the capture acquisition or disposal of a person with intent to reduce him to slavery; all acts involved in the acquisition of a slave with a view to selling or exchanging him; all acts of disposal by sale or exchange of a slave acquired with a view to being sold or exchanged and in general every act of trade or transport in slaves."
        },
        {
            "@language": "es",
            "@value": "Condición de una persona: - obligada a trabajar mediante amenazas psicológicas o físicas;- convertida en propiedad de un «empleador» generalmente mediante maltrato físico o mental o mediante amenazas de maltrato;- deshumanizada y tratada como una mercancía o comprada y vendida como si fuera un bien;- a la que se le imponen limitaciones físicas o se le restringe la libertad de movimiento."
        },
        {
            "@language": "en",
            "@value": "status or condition of a person who is:- forced to work - through coercion or mental or physical threat; and/or - owned or controlled by an 'employer' through mental or physical abuse or the threat of abuse; and/or - dehumanised treated as a commodity or bought and sold as 'property'; and/or- physically constrained or has restrictions placed on his/her freedom of movement"
        },
        {
            "@language": "de",
            "@value": "Beherrschung von Personen und die Anwendung von Gewalt und/oder Betrug zum Zweck der wirtschaftlichen Ausbeutung in Form von Zwangsarbeit Zwangsprostitution Kinderarbeit Zwangsheirat Schuldknechtschaft etc."
        },
        {
            "@language": "nl",
            "@value": "overkoepelende term voor een aantal inbreuken op de arbeidswetgeving die kenmerkend waren ten tijde van de slavernij"
        },
        {
            "@language": "es",
            "@value": "Crimen en el que el autor ha ejercido uno de los atributos del derecho de propiedad sobre una o más personas como comprarlas venderlas prestarlas o darlas en trueque o imponerles algún tipo similar de privación de la libertad o en el que haya hecho que esa persona o personas realizaran uno o más actos de naturaleza sexual."
        },
        {
            "@language": "de",
            "@value": "Freiheitsberaubung und sexuelle Nötigung die in der jeweiligen Gesellschaft keine gesetzliche Grundlage besitzt"
        },
        {
            "@language": "es",
            "@value": "Situación de una persona\ncuya vulnerabilidad debida a cualquier circunstancia (generalmente por su\ncondición de menor mujer o extranjero sin papeles) es incrementada y explotada\npor tiempo indefinido en un entorno doméstico en el que se ve obligada a\nprestar servicios sin retribución y en condiciones de trabajo vulneradoras de\nsus derechos fundamentales de libertad igualdad o intimidad afectando a su\ndignidad personal."
        },
        {
            "@language": "en",
            "@value": "the situation of a vulnerable individual forced by physical and/or moral coercion to work without any real financial reward deprived of liberty and in a situation contrary to human dignity"
        },
        {
            "@language": "de",
            "@value": "Arbeit in Privathaushalten unter ausbeuterischen Bedingungen z.T. auch unter Anwendung von Gewalt und Freiheitsentzug"
        },
        {
            "@language": "nl",
            "@value": "de uitbuiting van huispersoneel"
        },
        {
            "@language": "es",
            "@value": "Experto independiente nombrado por el Consejo de Derechos Humanos de Naciones Unidas mediante la resolución 6/14 cuyo mandato incluye entre otras cosas examinar e informar sobre todas las formas contemporáneas de esclavitud y prácticas análogas promover la aplicación efectiva de las normas internacionales pertinentes sobre la esclavitud recomendar disposiciones y medidas y señalar los medios para atacar las causas y remediar las consecuencias de las formas contemporáneas de la esclavitud como la pobreza la discriminación y los conflictos."
        },
        {
            "@language": "en",
            "@value": "UN special rapporteur [ IATE:877306 ] appointed to examine and report on all contemporary forms of slavery and slavery-like practices as well as all other issues covered by the Working Group on Contemporary Forms of Slavery including forced prostitution and its human rights dimensions"
        },
        {
            "@language": "de",
            "@value": "VN-Sonderberichterstatter IATE:877306 mit dem Mandat (...) die heutigen Formen der Sklaverei – wie z. B. Schuldknechtschaft Leibeigenschaft Zwangsarbeit die Versklavung von Kindern Zwangsprostitution Zwangsehen - umfassend zu untersuchen und darüber in Jahresberichten zu berichten"
        }
    ]
}